use museum;
DROP TABLE if exists `AJ001_image_data`;
DROP TABLE if exists `AJ001_exhibition_hall`;
DROP TABLE if exists `AJ001_image_attribute`;
DROP TABLE if exists `AJ001_branch`;
DROP TABLE if exists `AJ001_exhibition_name`;
DROP TABLE if exists `museum_hall`;
DROP TABLE if exists `user_account`;
DROP TABLE if exists `city_table`;

CREATE TABLE `city_table`(
    school_id VARCHAR(6),
    city VARCHAR(10) NOT NULL,
    type VARCHAR(4) NOT NULL,
    name VARCHAR(50) NOT NULL,
    start_time DATETIME,
    end_time DATETIME,
    PRIMARY KEY(school_id)
);

CREATE TABLE `user_account`(
  	school_id VARCHAR(6),
    manager VARCHAR(20),
   	username VARCHAR(100) NOT NULL,
    name VARCHAR(50) NOT NULL,
    password VARCHAR(50) NOT NULL,
    position VARCHAR(50),
    permission tinyint,
    PRIMARY KEY(username),
    FOREIGN KEY(school_id) REFERENCES `city_table`(school_id)
);

INSERT INTO user_account(manager,username,name,password,position,permission)
VALUES ("system_admin","admin","admin","1990","admin",0);

CREATE TABLE `museum_hall`(
	exhibition_hall VARCHAR(30),
    art_place VARCHAR(10),
    PRIMARY KEY(art_place)
);

INSERT INTO museum_hall(exhibition_hall,art_place)
VALUES 
("塔瓦多美術館","MA001"),("塔瓦多美術館","MA002"),("塔瓦多美術館","MA003"),("塔瓦多美術館","MA004"),("塔瓦多美術館","MA005"),
("塔瓦多美術館","MA006"),("塔瓦多美術館","MA007"),("塔瓦多美術館","MA008"),("塔瓦多美術館","MA009"),("塔瓦多美術館","MA010"),
("塔瓦多美術館","MA011"),("塔瓦多美術館","MA012"),("塔瓦多美術館","MA013"),("塔瓦多美術館","MA014"),("塔瓦多美術館","MA015"),
("塔瓦多美術館","MA016"),("塔瓦多美術館","MA017"),

("塔瓦多美術館","MB001"),("塔瓦多美術館","MB002"),("塔瓦多美術館","MB003"),("塔瓦多美術館","MB004"),("塔瓦多美術館","MB005"),
("塔瓦多美術館","MB006"),("塔瓦多美術館","MB007"),("塔瓦多美術館","MB008"),("塔瓦多美術館","MB009"),("塔瓦多美術館","MB010"),
("塔瓦多美術館","MB011"),("塔瓦多美術館","MB012"),("塔瓦多美術館","MB013"),("塔瓦多美術館","MB014"),("塔瓦多美術館","MB015"),
("塔瓦多美術館","MB016"),("塔瓦多美術館","MB017"),("塔瓦多美術館","MB018"),("塔瓦多美術館","MB019"),("塔瓦多美術館","MB020"),

("塔瓦多美術館","MC001"),("塔瓦多美術館","MC002"),("塔瓦多美術館","MC003"),("塔瓦多美術館","MC004"),("塔瓦多美術館","MC005"),
("塔瓦多美術館","MC006"),("塔瓦多美術館","MC007"),("塔瓦多美術館","MC008"),("塔瓦多美術館","MC009"),("塔瓦多美術館","MC010"),
("塔瓦多美術館","MC011"),("塔瓦多美術館","MC012"),("塔瓦多美術館","MC013"),("塔瓦多美術館","MC014"),("塔瓦多美術館","MC015"),
("塔瓦多美術館","MC016"),

("塔瓦多美術館","MD001"),("塔瓦多美術館","MD002"),("塔瓦多美術館","MD003"),("塔瓦多美術館","MD004"),("塔瓦多美術館","MD005"),
("塔瓦多美術館","MD006"),("塔瓦多美術館","MD007"),("塔瓦多美術館","MD008"),("塔瓦多美術館","MD009"),("塔瓦多美術館","MD010"),
("塔瓦多美術館","MD011"),("塔瓦多美術館","MD012"),("塔瓦多美術館","MD013"),("塔瓦多美術館","MD014"),("塔瓦多美術館","MD015"),
("塔瓦多美術館","MD016"),("塔瓦多美術館","MD017"),("塔瓦多美術館","MD018"),("塔瓦多美術館","MD019"),("塔瓦多美術館","MD020"),
("塔瓦多美術館","MD021"),("塔瓦多美術館","MD022"),("塔瓦多美術館","MD023"),("塔瓦多美術館","MD024"),("塔瓦多美術館","MD025"),
("塔瓦多美術館","MD026"),("塔瓦多美術館","MD027"),("塔瓦多美術館","MD028"),("塔瓦多美術館","MD029"),("塔瓦多美術館","MD030"),
("塔瓦多美術館","MD031"),("塔瓦多美術館","MD032"),("塔瓦多美術館","MD033"),("塔瓦多美術館","MD034"),

("塔瓦多美術館","ME001"),("塔瓦多美術館","ME002"),("塔瓦多美術館","ME003"),("塔瓦多美術館","ME004"),("塔瓦多美術館","ME005"),
("塔瓦多美術館","ME006"),("塔瓦多美術館","ME007"),("塔瓦多美術館","ME008"),("塔瓦多美術館","ME009"),("塔瓦多美術館","ME010"),
("塔瓦多美術館","ME011"),("塔瓦多美術館","ME012"),("塔瓦多美術館","ME013"),("塔瓦多美術館","ME014"),("塔瓦多美術館","ME015"),
("塔瓦多美術館","ME016"),("塔瓦多美術館","ME017"),("塔瓦多美術館","ME018"),("塔瓦多美術館","ME019"),("塔瓦多美術館","ME020"),
("塔瓦多美術館","ME021"),("塔瓦多美術館","ME022"),("塔瓦多美術館","ME023"),("塔瓦多美術館","ME024"),("塔瓦多美術館","ME025"),
("塔瓦多美術館","ME026"),("塔瓦多美術館","ME027"),("塔瓦多美術館","ME028"),("塔瓦多美術館","ME029"),("塔瓦多美術館","ME030"),
("塔瓦多美術館","ME031"),("塔瓦多美術館","ME032"),("塔瓦多美術館","ME033"),

("滑聖盾美術館","GA001"),("滑聖盾美術館","GA002"),("滑聖盾美術館","GA003"),("滑聖盾美術館","GA004"),("滑聖盾美術館","GA005"),
("滑聖盾美術館","GA006"),("滑聖盾美術館","GA007"),("滑聖盾美術館","GA008"),("滑聖盾美術館","GA009"),("滑聖盾美術館","GA010"),

("滑聖盾美術館","GB001"),("滑聖盾美術館","GB002"),("滑聖盾美術館","GB003"),("滑聖盾美術館","GB004"),("滑聖盾美術館","GB005"),
("滑聖盾美術館","GB006"),("滑聖盾美術館","GB007"),("滑聖盾美術館","GB008"),("滑聖盾美術館","GB009"),("滑聖盾美術館","GB010"),
("滑聖盾美術館","GB011"),("滑聖盾美術館","GB012"),("滑聖盾美術館","GB013"),("滑聖盾美術館","GB014"),("滑聖盾美術館","GB015"),
("滑聖盾美術館","GB016"),

("滑聖盾美術館","GC001"),("滑聖盾美術館","GC002"),("滑聖盾美術館","GC003"),("滑聖盾美術館","GC004"),("滑聖盾美術館","GC005"),
("滑聖盾美術館","GC006"),("滑聖盾美術館","GC007"),("滑聖盾美術館","GC008"),("滑聖盾美術館","GC009"),("滑聖盾美術館","GC010"),
("滑聖盾美術館","GC011"),("滑聖盾美術館","GC012"),

("滑聖盾美術館","GD001"),("滑聖盾美術館","GD002"),("滑聖盾美術館","GD003"),("滑聖盾美術館","GD004"),("滑聖盾美術館","GD005"),
("滑聖盾美術館","GD006"),("滑聖盾美術館","GD007"),

("滑聖盾美術館","GE001"),("滑聖盾美術館","GE002"),("滑聖盾美術館","GE003"),("滑聖盾美術館","GE004"),("滑聖盾美術館","GE005"),
("滑聖盾美術館","GE006"),("滑聖盾美術館","GE007"),("滑聖盾美術館","GE008"),("滑聖盾美術館","GE009"),("滑聖盾美術館","GE010"),
("滑聖盾美術館","GE011"),("滑聖盾美術館","GE012"),

("滑聖盾美術館","GF001"),("滑聖盾美術館","GF002"),("滑聖盾美術館","GF003"),("滑聖盾美術館","GF004"),("滑聖盾美術館","GF005"),
("滑聖盾美術館","GF006"),("滑聖盾美術館","GF007"),

("滑聖盾美術館","GG001"),("滑聖盾美術館","GG002"),("滑聖盾美術館","GG003"),("滑聖盾美術館","GG004"),("滑聖盾美術館","GG005"),
("滑聖盾美術館","GG006"),("滑聖盾美術館","GG007"),

("滑聖盾美術館","GH001"),("滑聖盾美術館","GH002"),("滑聖盾美術館","GH003"),("滑聖盾美術館","GH004"),("滑聖盾美術館","GH005"),
("滑聖盾美術館","GH006"),("滑聖盾美術館","GH007"),

("滑聖盾美術館","GI001"),("滑聖盾美術館","GI002"),("滑聖盾美術館","GI003"),("滑聖盾美術館","GI004"),("滑聖盾美術館","GI005"),
("滑聖盾美術館","GI006"),("滑聖盾美術館","GI007"),

("滑聖盾美術館","GJ001"),("滑聖盾美術館","GJ002"),("滑聖盾美術館","GJ003"),("滑聖盾美術館","GJ004"),("滑聖盾美術館","GJ005"),
("滑聖盾美術館","GJ006"),("滑聖盾美術館","GJ007"),

("滑聖盾美術館","GK001"),("滑聖盾美術館","GK002"),("滑聖盾美術館","GK003"),("滑聖盾美術館","GK004"),("滑聖盾美術館","GK005"),
("滑聖盾美術館","GK006"),("滑聖盾美術館","GK007"),("滑聖盾美術館","GK008"),

("滑聖盾美術館","GL001"),("滑聖盾美術館","GL002"),("滑聖盾美術館","GL003"),("滑聖盾美術館","GL004"),("滑聖盾美術館","GL005"),
("滑聖盾美術館","GL006"),("滑聖盾美術館","GL007"),("滑聖盾美術館","GL008"),("滑聖盾美術館","GL009"),("滑聖盾美術館","GL010"),
("滑聖盾美術館","GL011"),("滑聖盾美術館","GL012"),("滑聖盾美術館","GL013"),

("滑聖盾美術館","GM001"),("滑聖盾美術館","GM002"),("滑聖盾美術館","GM003"),("滑聖盾美術館","GM004"),("滑聖盾美術館","GM005"),
("滑聖盾美術館","GM006"),("滑聖盾美術館","GM007"),("滑聖盾美術館","GM008"),

("滑聖盾美術館","GN001"),("滑聖盾美術館","GN002"),("滑聖盾美術館","GN003"),("滑聖盾美術館","GN004"),("滑聖盾美術館","GN005"),
("滑聖盾美術館","GN006"),

("滑聖盾美術館","GO001"),("滑聖盾美術館","GO002"),("滑聖盾美術館","GO003"),("滑聖盾美術館","GO004"),("滑聖盾美術館","GO005"),
("滑聖盾美術館","GO006"),

("咪咪美術館","AA001"),("咪咪美術館","AA002"),("咪咪美術館","AA003"),("咪咪美術館","AA004"),("咪咪美術館","AA005"),
("咪咪美術館","AA006"),("咪咪美術館","AA007"),("咪咪美術館","AA008"),("咪咪美術館","AA009"),("咪咪美術館","AA010"),
("咪咪美術館","AA011"),("咪咪美術館","AA012"),("咪咪美術館","AA013"),("咪咪美術館","AA014"),

("咪咪美術館","AB001"),("咪咪美術館","AB002"),("咪咪美術館","AB003"),("咪咪美術館","AB004"),("咪咪美術館","AB005"),
("咪咪美術館","AB006"),("咪咪美術館","AB007"),("咪咪美術館","AB008"),("咪咪美術館","AB009"),("咪咪美術館","AB010"),
("咪咪美術館","AB011"),("咪咪美術館","AB012"),("咪咪美術館","AB013"),("咪咪美術館","AB014"),("咪咪美術館","AB015"),

("咪咪美術館","AC001"),("咪咪美術館","AC002"),("咪咪美術館","AC003"),("咪咪美術館","AC004"),("咪咪美術館","AC005"),
("咪咪美術館","AC006"),("咪咪美術館","AC007"),("咪咪美術館","AC008"),("咪咪美術館","AC009"),("咪咪美術館","AC010"),
("咪咪美術館","AC011"),("咪咪美術館","AC012"),("咪咪美術館","AC013"),("咪咪美術館","AC014"),("咪咪美術館","AC015"),
("咪咪美術館","AC016"),("咪咪美術館","AC017"),("咪咪美術館","AC018"),("咪咪美術館","AC019"),("咪咪美術館","AC020"),

("咪咪美術館","AD001"),("咪咪美術館","AD002"),("咪咪美術館","AD003"),("咪咪美術館","AD004"),("咪咪美術館","AD005"),
("咪咪美術館","AD006"),("咪咪美術館","AD007"),("咪咪美術館","AD008"),("咪咪美術館","AD009"),("咪咪美術館","AD010"),

("咪咪美術館","AD2F001"),("咪咪美術館","AD2F002"),("咪咪美術館","AD2F003"),("咪咪美術館","AD2F004"),("咪咪美術館","AD2F005"),
("咪咪美術館","AD2F006"),("咪咪美術館","AD2F007"),("咪咪美術館","AD2F008"),("咪咪美術館","AD2F009"),("咪咪美術館","AD2F010"),
("咪咪美術館","AD2F011"),("咪咪美術館","AD2F012"),("咪咪美術館","AD2F013"),("咪咪美術館","AD2F014"),("咪咪美術館","AD2F015"),
("咪咪美術館","AD2F016"),("咪咪美術館","AD2F017"),

("咪咪美術館","ADB001"),("咪咪美術館","ADB002"),("咪咪美術館","ADB003"),("咪咪美術館","ADB004"),("咪咪美術館","ADB005"),
("咪咪美術館","ADB006"),("咪咪美術館","ADB007"),("咪咪美術館","ADB008"),("咪咪美術館","ADB009"),("咪咪美術館","ADB010"),
("咪咪美術館","ADB011"),("咪咪美術館","ADB012"),("咪咪美術館","ADB013"),("咪咪美術館","ADB014"),("咪咪美術館","ADB015"),
("咪咪美術館","ADB016"),("咪咪美術館","ADB017"),

("咪咪美術館","AE001"),("咪咪美術館","AE002"),("咪咪美術館","AE003"),("咪咪美術館","AE004"),("咪咪美術館","AE005"),
("咪咪美術館","AE006"),("咪咪美術館","AE007"),

("咪咪美術館","AF001"),("咪咪美術館","AF002"),("咪咪美術館","AF003"),("咪咪美術館","AF004"),("咪咪美術館","AF005"),
("咪咪美術館","AF006"),("咪咪美術館","AF007"),("咪咪美術館","AF008"),("咪咪美術館","AF009"),("咪咪美術館","AF010"),
("咪咪美術館","AF011"),("咪咪美術館","AF012");



/*
CREATE TABLE `AJ001_branch`(
	branch VARCHAR(50),
    branch_create_time DATETIME,
    PRIMARY KEY(branch)
);

CREATE TABLE `AJ001_exhibition_name`(
	exhibition_name VARCHAR(50),
    exhibition_museum VARCHAR(30),
    exhibition_name_create_time DATETIME,
    PRIMARY KEY(exhibition_name)
);

CREATE TABLE `AJ001_image_attribute`(
	image_id VARCHAR(15) NOT NULL,
    uploader VARCHAR(20),
    image_title VARCHAR(300),
    image_path VARCHAR(500),
    voice_title VARCHAR(300),
    voice_path VARCHAR(500),
    PRIMARY KEY(image_id)
);

CREATE TABLE `AJ001_exhibition_hall`(
    image_id VARCHAR(15),
    exhibition_name VARCHAR(50),
    art_place VARCHAR(10),
    FOREIGN KEY(image_id) REFERENCES `AJ001_image_attribute`(image_id),
    FOREIGN KEY(art_place) REFERENCES `museum_hall`(art_place),
    PRIMARY KEY(exhibition_name,art_place)
);

CREATE TABLE `AJ001_image_data`(
	image_id VARCHAR(15),
    art_name VARCHAR(50),
    art_author VARCHAR(50),
    art_description VARCHAR(500),
    author_class VARCHAR(50),
    art_upload_time DATETIME,
	PRIMARY KEY(image_id),
    FOREIGN KEY(image_id) REFERENCES `AJ001_image_attribute`(image_id)
);
*/