use museum;
DROP TABLE if exists `AJ001_image_data`;
DROP TABLE if exists `AJ001_exhibition_hall`;
DROP TABLE if exists `AJ001_image_attribute`;
DROP TABLE if exists `AJ001_branch`;
DROP TABLE if exists `museum_hall`;
DROP TABLE if exists `user_account`;
DROP TABLE if exists `city_table`;

CREATE TABLE `city_table`(
    school_id VARCHAR(6),
    city VARCHAR(10) NOT NULL,
    type VARCHAR(4) NOT NULL,
    name VARCHAR(50) NOT NULL,
    start_time DATETIME,
    end_time DATETIME,
    PRIMARY KEY(school_id)
);

CREATE TABLE `user_account`(
  	school_id VARCHAR(6),
   	username VARCHAR(100) NOT NULL,
    name VARCHAR(50) NOT NULL,
    password VARCHAR(50) NOT NULL,
    position VARCHAR(50),
    permission tinyint,
    PRIMARY KEY(username),
    FOREIGN KEY(school_id) REFERENCES `city_table`(school_id)
);

INSERT INTO user_account(username,name,password,position,permission)
VALUES ("admin","admin","1990","admin",0);

CREATE TABLE `museum_hall`(
	exhibition_hall VARCHAR(30),
    art_place VARCHAR(10),
    PRIMARY KEY(art_place)
);

INSERT INTO museum_hall(exhibition_hall,art_place)
VALUES ("北美館","AA001"),
("北美館","AA002"),
("北美館","AA003"),
("北美館","AA004"),
("北美館","AA005"),
("北美館","AA006"),
("北美館","AA007"),
("北美館","AA008"),
("北美館","AA009"),
("北美館","AA010"),
("新北館","FA001"),
("新北館","FA002"),
("新北館","FA003"),
("新北館","FA004"),
("新北館","FA005"),
("新北館","FA006"),
("新北館","FA007"),
("新北館","FA008"),
("新北館","FA009"),
("新北館","FA010"),
("滑聖盾美術館","GA001"),("滑聖盾美術館","GA002"),("滑聖盾美術館","GA003"),("滑聖盾美術館","GA004"),("滑聖盾美術館","GA005"),
("滑聖盾美術館","GA006"),("滑聖盾美術館","GA007"),("滑聖盾美術館","GA008"),("滑聖盾美術館","GA009"),("滑聖盾美術館","GA010"),
("滑聖盾美術館","GA011"),("滑聖盾美術館","GA012"),("滑聖盾美術館","GA013"),("滑聖盾美術館","GA014"),

("滑聖盾美術館","GB001"),("滑聖盾美術館","GB002"),("滑聖盾美術館","GB003"),("滑聖盾美術館","GB004"),("滑聖盾美術館","GB005"),
("滑聖盾美術館","GB006"),("滑聖盾美術館","GB007"),("滑聖盾美術館","GB008"),("滑聖盾美術館","GB009"),("滑聖盾美術館","GB010"),
("滑聖盾美術館","GB011"),("滑聖盾美術館","GB012"),("滑聖盾美術館","GB013"),("滑聖盾美術館","GB014"),("滑聖盾美術館","GB015"),
("滑聖盾美術館","GB016"),("滑聖盾美術館","GB017"),("滑聖盾美術館","GB018"),("滑聖盾美術館","GB019"),

("滑聖盾美術館","GC001"),("滑聖盾美術館","GC002"),("滑聖盾美術館","GC003"),("滑聖盾美術館","GC004"),("滑聖盾美術館","GC005"),
("滑聖盾美術館","GC006"),("滑聖盾美術館","GC007"),("滑聖盾美術館","GC008"),("滑聖盾美術館","GC009"),("滑聖盾美術館","GC010"),
("滑聖盾美術館","GC011"),("滑聖盾美術館","GC012"),("滑聖盾美術館","GC013"),("滑聖盾美術館","GC014"),("滑聖盾美術館","GC015"),
("滑聖盾美術館","GC016"),("滑聖盾美術館","GC017"),("滑聖盾美術館","GC018"),

("滑聖盾美術館","GD001"),("滑聖盾美術館","GD002"),("滑聖盾美術館","GD003"),("滑聖盾美術館","GD004"),("滑聖盾美術館","GD005"),
("滑聖盾美術館","GD006"),("滑聖盾美術館","GD007"),("滑聖盾美術館","GD008"),("滑聖盾美術館","GD009"),("滑聖盾美術館","GD010"),
("滑聖盾美術館","GD011"),("滑聖盾美術館","GD012"),("滑聖盾美術館","GD013"),("滑聖盾美術館","GD014"),("滑聖盾美術館","GD015"),
("滑聖盾美術館","GD016"),

("滑聖盾美術館","GE001"),("滑聖盾美術館","GE002"),("滑聖盾美術館","GE003"),("滑聖盾美術館","GE004"),("滑聖盾美術館","GE005"),
("滑聖盾美術館","GE006"),("滑聖盾美術館","GE007"),("滑聖盾美術館","GE008"),("滑聖盾美術館","GE009"),("滑聖盾美術館","GE010"),
("滑聖盾美術館","GE011"),("滑聖盾美術館","GE012"),("滑聖盾美術館","GE013"),("滑聖盾美術館","GE014"),("滑聖盾美術館","GE015"),
("滑聖盾美術館","GE016"),("滑聖盾美術館","GE017"),("滑聖盾美術館","GE018"),("滑聖盾美術館","GE019"),("滑聖盾美術館","GE020"),

("滑聖盾美術館","GF001"),("滑聖盾美術館","GF002"),("滑聖盾美術館","GF003"),("滑聖盾美術館","GF004"),("滑聖盾美術館","GF005"),
("滑聖盾美術館","GF006"),("滑聖盾美術館","GF007"),("滑聖盾美術館","GF008"),("滑聖盾美術館","GF009"),("滑聖盾美術館","GF010"),
("滑聖盾美術館","GF011"),("滑聖盾美術館","GF012"),("滑聖盾美術館","GF013"),

("滑聖盾美術館","GG001"),("滑聖盾美術館","GG002"),("滑聖盾美術館","GG003"),("滑聖盾美術館","GG004"),("滑聖盾美術館","GG005"),
("滑聖盾美術館","GG006"),("滑聖盾美術館","GG007"),("滑聖盾美術館","GG008"),("滑聖盾美術館","GG009"),("滑聖盾美術館","GG010"),
("滑聖盾美術館","GG011"),("滑聖盾美術館","GG012"),("滑聖盾美術館","GG013"),

("滑聖盾美術館","GH001"),("滑聖盾美術館","GH002"),("滑聖盾美術館","GH003"),("滑聖盾美術館","GH004"),("滑聖盾美術館","GH005"),
("滑聖盾美術館","GH006"),("滑聖盾美術館","GH007"),("滑聖盾美術館","GH008"),("滑聖盾美術館","GH009"),("滑聖盾美術館","GH010"),
("滑聖盾美術館","GH011"),

("滑聖盾美術館","GI001"),("滑聖盾美術館","GI002"),("滑聖盾美術館","GI003"),("滑聖盾美術館","GI004"),("滑聖盾美術館","GI005"),
("滑聖盾美術館","GI006"),("滑聖盾美術館","GI007"),("滑聖盾美術館","GI008"),("滑聖盾美術館","GI009"),("滑聖盾美術館","GI010"),

("滑聖盾美術館","GJ001"),("滑聖盾美術館","GJ002"),("滑聖盾美術館","GJ003"),("滑聖盾美術館","GJ004"),("滑聖盾美術館","GJ005"),
("滑聖盾美術館","GJ006"),("滑聖盾美術館","GJ007"),("滑聖盾美術館","GJ008"),("滑聖盾美術館","GJ009"),("滑聖盾美術館","GJ010"),
("滑聖盾美術館","GJ011"),

("滑聖盾美術館","GK001"),("滑聖盾美術館","GK002"),("滑聖盾美術館","GK003"),("滑聖盾美術館","GK004"),("滑聖盾美術館","GK005"),
("滑聖盾美術館","GK006"),("滑聖盾美術館","GK007"),("滑聖盾美術館","GK008"),("滑聖盾美術館","GK009"),("滑聖盾美術館","GK010"),
("滑聖盾美術館","GK011"),("滑聖盾美術館","GK012"),("滑聖盾美術館","GK013"),

("滑聖盾美術館","GL001"),("滑聖盾美術館","GL002"),("滑聖盾美術館","GL003"),("滑聖盾美術館","GL004"),("滑聖盾美術館","GL005"),
("滑聖盾美術館","GL006"),("滑聖盾美術館","GL007"),("滑聖盾美術館","GL008"),("滑聖盾美術館","GL009"),("滑聖盾美術館","GL010"),
("滑聖盾美術館","GL011"),("滑聖盾美術館","GL012"),("滑聖盾美術館","GL013"),("滑聖盾美術館","GL014"),("滑聖盾美術館","GL015"),
("滑聖盾美術館","GL016"),("滑聖盾美術館","GL017"),("滑聖盾美術館","GL018"),("滑聖盾美術館","GL019"),("滑聖盾美術館","GL020"),

("滑聖盾美術館","GM001"),("滑聖盾美術館","GM002"),("滑聖盾美術館","GM003"),("滑聖盾美術館","GM004"),("滑聖盾美術館","GM005"),
("滑聖盾美術館","GM006"),("滑聖盾美術館","GM007"),("滑聖盾美術館","GM008"),("滑聖盾美術館","GM009"),("滑聖盾美術館","GM010"),
("滑聖盾美術館","GM011"),("滑聖盾美術館","GM012"),("滑聖盾美術館","GM013"),

("滑聖盾美術館","GN001"),("滑聖盾美術館","GN002"),("滑聖盾美術館","GN003"),("滑聖盾美術館","GN004"),("滑聖盾美術館","GN005"),
("滑聖盾美術館","GN006"),("滑聖盾美術館","GN007"),("滑聖盾美術館","GN008"),("滑聖盾美術館","GN009"),("滑聖盾美術館","GN010"),
("滑聖盾美術館","GN011"),

("滑聖盾美術館","GO001"),("滑聖盾美術館","GO002"),("滑聖盾美術館","GO003"),("滑聖盾美術館","GO004"),("滑聖盾美術館","GO005"),
("滑聖盾美術館","GO006"),("滑聖盾美術館","GO007"),("滑聖盾美術館","GO008"),("滑聖盾美術館","GO009"),("滑聖盾美術館","GO010"),
("滑聖盾美術館","GO011"),

("咪咪美術館","AA001"),("咪咪美術館","AA002"),("咪咪美術館","AA003"),("咪咪美術館","AA004"),("咪咪美術館","AA005"),
("咪咪美術館","AA006"),("咪咪美術館","AA007"),("咪咪美術館","AA008"),("咪咪美術館","AA009"),("咪咪美術館","AA010"),
("咪咪美術館","AA011"),("咪咪美術館","AA012"),("咪咪美術館","AA013"),("咪咪美術館","AA014"),

("咪咪美術館","AB001"),("咪咪美術館","AB002"),("咪咪美術館","AB003"),("咪咪美術館","AB004"),("咪咪美術館","AB005"),
("咪咪美術館","AB006"),("咪咪美術館","AB007"),("咪咪美術館","AB008"),("咪咪美術館","AB009"),("咪咪美術館","AB010"),
("咪咪美術館","AB011"),("咪咪美術館","AB012"),("咪咪美術館","AB013"),("咪咪美術館","AB014"),("咪咪美術館","AB015"),

("咪咪美術館","AC001"),("咪咪美術館","AC002"),("咪咪美術館","AC003"),("咪咪美術館","AC004"),("咪咪美術館","AC005"),
("咪咪美術館","AC006"),("咪咪美術館","AC007"),("咪咪美術館","AC008"),("咪咪美術館","AC009"),("咪咪美術館","AC010"),
("咪咪美術館","AC011"),("咪咪美術館","AC012"),("咪咪美術館","AC013"),("咪咪美術館","AC014"),("咪咪美術館","AC015"),
("咪咪美術館","AC016"),("咪咪美術館","AC017"),("咪咪美術館","AC018"),("咪咪美術館","AC019"),("咪咪美術館","AC020"),

("咪咪美術館","AD001"),("咪咪美術館","AD002"),("咪咪美術館","AD003"),("咪咪美術館","AD004"),("咪咪美術館","AD005"),
("咪咪美術館","AD006"),("咪咪美術館","AD007"),("咪咪美術館","AD008"),("咪咪美術館","AD009"),("咪咪美術館","AD010"),

("咪咪美術館","AD2F001"),("咪咪美術館","AD2F002"),("咪咪美術館","AD2F003"),("咪咪美術館","AD2F004"),("咪咪美術館","AD2F005"),
("咪咪美術館","AD2F006"),("咪咪美術館","AD2F007"),("咪咪美術館","AD2F008"),("咪咪美術館","AD2F009"),("咪咪美術館","AD2F010"),
("咪咪美術館","AD2F011"),("咪咪美術館","AD2F012"),("咪咪美術館","AD2F013"),("咪咪美術館","AD2F014"),("咪咪美術館","AD2F015"),
("咪咪美術館","AD2F016"),("咪咪美術館","AD2F017"),

("咪咪美術館","ADB001"),("咪咪美術館","ADB002"),("咪咪美術館","ADB003"),("咪咪美術館","ADB004"),("咪咪美術館","ADB005"),
("咪咪美術館","ADB006"),("咪咪美術館","ADB007"),("咪咪美術館","ADB008"),("咪咪美術館","ADB009"),("咪咪美術館","ADB010"),
("咪咪美術館","ADB011"),("咪咪美術館","ADB012"),("咪咪美術館","ADB013"),("咪咪美術館","ADB014"),("咪咪美術館","ADB015"),
("咪咪美術館","ADB016"),("咪咪美術館","ADB017"),

("咪咪美術館","AE001"),("咪咪美術館","AE002"),("咪咪美術館","AE003"),("咪咪美術館","AE004"),("咪咪美術館","AE005"),
("咪咪美術館","AE006"),("咪咪美術館","AE007"),

("咪咪美術館","AF001"),("咪咪美術館","AF002"),("咪咪美術館","AF003"),("咪咪美術館","AF004"),("咪咪美術館","AF005"),
("咪咪美術館","AF006"),("咪咪美術館","AF007"),("咪咪美術館","AF008"),("咪咪美術館","AF009"),("咪咪美術館","AF010"),
("咪咪美術館","AF011"),("咪咪美術館","AF012"),



/*
CREATE TABLE `AJ001_branch`(
	branch VARCHAR(50),
    branch_create_time DATETIME,
    PRIMARY KEY(branch)
);

CREATE TABLE `AJ001_image_attribute`(
	image_id VARCHAR(15) NOT NULL,
    uploader VARCHAR(20),
    image_title VARCHAR(300),
    image_path VARCHAR(500),
    voice_title VARCHAR(300),
    voice_path VARCHAR(500),
    PRIMARY KEY(image_id),
    FOREIGN KEY(uploader) REFERENCES `user_account`(username)
);

CREATE TABLE `AJ001_exhibition_hall`(
    image_id VARCHAR(15),
    branch VARCHAR(50),
    art_place VARCHAR(10),
    FOREIGN KEY(image_id) REFERENCES `AJ001_image_attribute`(image_id),
    FOREIGN KEY(branch) REFERENCES `AJ001_branch`(branch),
    FOREIGN KEY(art_place) REFERENCES `museum_hall`(art_place),
    PRIMARY KEY(branch,art_place)
);

CREATE TABLE `AJ001_image_data`(
	image_id VARCHAR(15),
    art_name VARCHAR(50),
    art_author VARCHAR(50),
    art_description VARCHAR(500),
    author_class VARCHAR(50),
    art_upload_time DATETIME,
	PRIMARY KEY(image_id),
    FOREIGN KEY(image_id) REFERENCES `AJ001_image_attribute`(image_id),
    FOREIGN KEY(author_class) REFERENCES `AJ001_branch`(branch)
);
*/